################################################################################
# Base dependencies
################################################################################
tap "homebrew/cask"
brew "mas"


################################################################################
# CLI and Dev Tools
################################################################################

# Shells  ---
brew "bash"
brew "bash-completion2"
brew "zsh"

# Installing GNU utils  ---
brew "coreutils"    # PATH="$BREW_PREFIX/opt/coreutils/libexec/gnubin:$PATH"
brew "findutils"    # PATH="$BREW_PREFIX/opt/findutils/libexec/gnubin:$PATH"
brew "gnu-sed"      # PATH="$BREW_PREFIX/opt/gnu-sed/libexec/gnubin:$PATH"
brew "gnu-tar"      # PATH="$BREW_PREFIX/opt/gnu-tar/libexec/gnubin:$PATH"
brew "grep"         # PATH="$BREW_PREFIX/opt/grep/libexec/gnubin:$PATH"
brew "moreutils"

# Installing more recent versions of some macOS tools  ---
brew "vim"
brew "openssh"
brew "screen"
brew "gmp"

# Install python dev tools  ---
brew "pyenv"
brew "pipenv"

# Installing cool fonts  ---
tap "bramstein/webfonttools"
brew "sfnt2woff"
brew "sfnt2woff-zopfli"
brew "woff2"
brew "svn"
tap "homebrew/cask-fonts"
cask "font-oswald"
cask "font-open-sans"
cask "font-lora"
cask "font-juliamono"
cask "font-hack-nerd-font"

# Installing useful more command line utils  ---
brew "curl"
brew "wget"
brew "htop"
brew "tree"
brew "glow"                 # https://github.com/charmbracelet/glow
brew "fzf"                  # https://github.com/junegunn/fzf
brew "openssl"
brew "readline"
brew "sqlite"
brew "golang"               # old unavailable flag: --cross-compile-common
brew "ruby"
cask "r"
brew "graphviz"
brew "postgresql"
brew "node"
tap "dart-lang/dart"
brew "dart"
brew "yarn"
brew "redis"
brew "mackup"
brew "hugo"                 # https://gohugo.io/getting-started/installing/
brew "ffmpeg"
brew "thefuck"
brew "ncdu"                 # https://dev.yorhel.nl/ncdu
brew "shellcheck"           # https://github.com/koalaman/shellcheck
brew "bat"                  # https://github.com/sharkdp/bat
brew "awscli"
brew "pre-commit"
brew "cookiecutter"

# Upgrading git  ---
brew "git"
brew "git-crypt"
brew "gpg"
brew "git-lfs"

# Installing compilers  ---
brew "cmake"
brew "llvm"
brew "gcc"
brew "libomp"

# Installing iTerm2  ---
# Other terminal emulators to consider:
# - [alacritty](https://github.com/alacritty/alacritty) - A cross-platform, GPU-accelerated terminal emulator
cask "iterm2"

# Installing docker and virtualbox  ---
cask "docker"
cask "kitematic"
cask "virtualbox"

# Installing Kubernetes dev tools  ---
brew "kubectx"                  # https://github.com/ahmetb/kubectx
brew "k9s"                      # https://github.com/derailed/k9s
brew "kube-ps1"                 # https://github.com/jonmosco/kube-ps1
brew "aws-iam-authenticator"    # https://github.com/kubernetes-sigs/aws-iam-authenticator
tap "ubuntu/microk8s"
cask "multipass"                # https://multipass.run/
brew "microk8s"                 # https://microk8s.io/
brew "helm"                     # https://github.com/helm/helm


################################################################################
# Desktop Applications
################################################################################

# Installing drivers  ---
tap "homebrew/cask-drivers"
cask "logitech-options"

# Installing Text editors and IDEs  ---
cask "jetbrains-toolbox"
cask "visual-studio-code"
cask "sublime-text"
cask "qlmarkdown"
cask "rstudio"
# Other dev applications  ---
cask "devbook"

# Installing Browsers  ---
cask "brave-browser"
cask "google-chrome"
cask "tor-browser"
cask "firefox"
mas "Grammarly for Safari", id: 1462114288

# Installing Productivity & Office apps  ---
cask "microsoft-office"
cask "the-unarchiver"
cask "whatsapp"
cask "slack"
cask "alfred"
cask "skitch"
cask "skype"
cask "the-unarchiver"
cask "whatsapp"
cask "slack"
cask "google-drive"
cask "notion"
cask "keepingyouawake"
cask "raindropio"
cask "zoom"

# Installing Misc apps  ---
cask "vuze"
cask "spotify"
cask "vlc"
cask "adobe-creative-cloud"
cask "blender"
cask "appcleaner"
cask "disk-inventory-x"
cask "muzzle"
cask "p4v"
cask "diffmerge"
cask "postman"
cask "jupyter-notebook-viewer"  # https://github.com/tuxu/nbviewer-app
cask "eul"                      # https://github.com/gao-sun/eul/
#tap "popcorn-official/popcorn-desktop", "https://github.com/popcorn-official/popcorn-desktop.git"
#cask "popcorn-time"
mas "GIPHY CAPTURE", id: 668208984
